[A_BlessingOfArkath H7HeroAbility]
mTooltipMagicGuild="在下场战斗开始时，对随机敌方目标造成 %buff.buff.d.icon 火系伤害。"
mTooltipMagicGuildRankLine="%buff.buff.d.min 到 %buff.buff.d.max %buff.buff.d.icon"
mTooltipUpgraded=""
mName="火龙之佑"
mTooltip="在下场战斗开始时，对 %buff.buff.special 个随机敌方目标造成 %buff.buff.d.min 到 %buff.buff.d.max %buff.buff.d.icon 火系伤害。"

[A_BlessingofArkath_Buff H7BaseBuff]
mName="火龙之佑"
mTooltip="在下场战斗开始时，对 %special 个随机敌方目标造成 %d.min 到 %d.max %d.icon 火系伤害。"

[A_BlessingOfArkath_Damage H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火龙之佑"
mTooltip=""

[A_Burning_Buff H7BaseBuff]
mName="燃烧不止"
mTooltip="在生物回合开始时，对其造成 %d.max %d.icon 火系伤害。\n持续 %durnow 回合。"

[A_Burning_FromCreature_Buff_Champion H7BaseBuff]
mName="燃烧不止"
mTooltip="在生物回合开始时，对其造成 %d.max %d.icon 火系伤害。\n持续 %durnow 回合。"

[A_Burning_FromCreature_Buff_Elite H7BaseBuff]
mName="燃烧不止"
mTooltip="在生物回合开始时，对其造成 %d.max %d.icon 火系伤害。\n持续 %durnow 回合。"

[A_BurningDetermination_Buff H7BaseBuff]
mName="燃烧意志"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"

[A_Firebolt H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 火系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 火系伤害，并在其接下来的 %buff.buff.durini 个回合开始时，对其造成 %buff.buff.d.max %buff.buff.d.icon 火系伤害。"
mName="烈焰飞弹"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 火系伤害。"

[A_FireSentry_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_FireSentry_Buff_Retaliation H7BaseBuff]
mName=""
mTooltip=""

[A_FireSentry_Obstacle_0_Unskilled H7CombatObstacleObject]
mObstacleName="烈焰哨位"

[A_FireSentry_Obstacle_1_Novice H7CombatObstacleObject]
mObstacleName="烈焰哨位"

[A_FireSentry_Obstacle_2_Expert H7CombatObstacleObject]
mObstacleName="烈焰哨位"

[A_FireSentry_Obstacle_3_Master H7CombatObstacleObject]
mObstacleName="烈焰哨位"

[A_FireSentry_Obstacle_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_FireSentry_Obstacle_Ability_Damage H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰射击"
mTooltip=""

[A_FireWall_Buff H7BaseBuff]
mName="火焰牢笼"
mTooltip=""

[A_Frenzy_Buff H7BaseBuff]
mName="癫狂诅咒 (普通)"
mTooltip=""

mName="癫狂诅咒 (强化/友方)"
mTooltip=""

mName="癫狂诅咒 (强化/敌方)"
mTooltip=""

[A_InnerFire H7HeroAbility]
mTooltipMagicGuild="提升目标单位的 %ICON_ATTACK 攻击和 %ICON_INITIATIVE 主动性，持续 %buff.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff.buff.stat1 %buff.buff.stat1.icon 攻击 和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff.buff.stat1 %buff.buff.stat1.icon 攻击 和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性，持续 %buff.buff.durini 回合。"
mName="心灵之火"
mTooltip="提升目标生物 %buff.buff.stat1 %buff.buff.stat1.icon 攻击 和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性，持续 %buff.buff.durini 回合。"

[Imprinted.A_Armageddon_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="末日审判"
mTooltip="立即对所有单位造成 %d.min 到 %d.max %d.icon 火系伤害。"

[Imprinted.A_BlessingOfArkath_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火龙之佑"
mTooltip="在下场战斗开始时，对 %buff.buff.special 个随机敌方目标造成 %buff.buff.d.min 到 %buff.buff.d.max %buff.buff.d.icon 火系伤害。"

[Imprinted.A_BlessingofArkath_Imprinted_Buff H7BaseBuff]
mName="火龙之佑"
mTooltip="在下场战斗开始时，对 %special 个随机敌方目标造成 %d.min 到 %d.max %d.icon 火系伤害。"

[Imprinted.A_BlessingOfArkath_Imprinted_Damage H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火龙之佑"
mTooltip=""

[Imprinted.A_BurningDetermination_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="燃烧意志"
mTooltip="提升目标友方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 士气，持续 %buff.buff.durini 回合。"

[Imprinted.A_BurningDetermination_Imprinted_Artifact H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="燃烧意志"
mTooltip="提升目标友方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 士气，持续 %buff.buff.durini 回合。"

[Imprinted.A_BurningDetermination_Imprinted_Artifact_Buff H7BaseBuff]
mName="燃烧意志"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"

[Imprinted.A_BurningDetermination_Imprinted_Buff H7BaseBuff]
mName="燃烧意志"
mTooltip="%stat %stat.icon 士气\n持续 %durnow 回合。"

[Imprinted.A_Fireball_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="连珠火球"
mTooltip="立即对目标3x3区域内的所有单位造成 %d.min 到 %d.max %d.icon 火系伤害。"

[Imprinted.A_Firebolt_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="烈焰飞弹"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 火系伤害。"

[Imprinted.A_FireSentry_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="烈焰哨位"
mTooltip="在目标空地上召唤一个1x1的烈焰哨位，拥有 %special.val1 点生命值。它持续到接下来2个战斗回合结束或被摧毁为止。烈焰哨位在每个战斗回合结束时和战斗回合中第一个进行远程攻击的敌方生物出现时，向两个最近的随机敌方生物射击。每次射击造成 %special.val2 到 %special.val3 %icon_fire 火系伤害。"

[Imprinted.A_FireSentry_Imprinted_Obstacle H7CombatObstacleObject]
mObstacleName="烈焰哨位"

[Imprinted.A_FireWall_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰牢笼"
mTooltip="在2X2区域内创造一个火焰牢笼，持续 %durini 战斗回合，在回合开始时对所有区域内的生物（以及进入该区域的生物）造成 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 火系伤害。将其移动力降低至0 %icon_movement"

[Imprinted.A_FireWall_Imprinted_Buff H7BaseBuff]
mName="火焰牢笼"
mTooltip=""

mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="癫狂诅咒"
mTooltip="使目标生物以 %buff1.buff.stat1 %buff1.buff.stat1.icon 攻击力攻击任何随机的相邻单位。"

[Imprinted.A_Frenzy_Imprinted_Buff H7BaseBuff]
mName="癫狂诅咒"
mTooltip=""

[Imprinted.A_InnerFire_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="心灵之火"
mTooltip="提升目标生物 %buff.buff.stat1 %buff.buff.stat1.icon 攻击 和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性，持续 %buff.buff.durini 回合。"

[Imprinted.A_InnerFire_Imprinted_Artifact H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="心灵之火"
mTooltip="提升目标生物 %buff.buff.stat1 %buff.buff.stat1.icon 攻击 和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性，持续 %buff.buff.durini 回合。"

[Imprinted.A_InnerFire_Imprinted_Artifact_Buff H7BaseBuff]
mName="心灵之火"
mTooltip="%stat1 %stat1.icon 攻击\n%stat2 %stat2.icon 主动性\n持续 %durnow 回合。"

[Imprinted.A_InnerFire_Imprinted_Buff H7BaseBuff]
mName="心灵之火"
mTooltip="%stat1 %stat1.icon 攻击\n%stat2 %stat2.icon 主动性\n持续 %durnow 回合。"

UCP 1.3 / 7.5_mod

[A_Frenzy_ImprovedBuff_Friendly H7BaseBuff]
mName="癫狂诅咒"
mTooltip=""

[A_Frenzy_ImprovedBuff_Hostile H7BaseBuff]
mName="癫狂诅咒"
mTooltip=""

[A_Frenzy H7HeroAbility]
mTooltipMagicGuild="使目标生物以增加或减少的 %buff1.buff.stat1.icon 攻击力攻击任何随机的相邻单位，具体取决于英雄的魔法。如果被攻击的生物是（攻击者的）友方，则该攻击不会被反击。"
mTooltipMagicGuildRankLine="%buff1.buff.stat1 %buff1.buff.stat1.icon 攻击"
mTooltipUpgraded="使目标生物以 %buff1.buff.stat1 %buff1.buff.stat1.icon 攻击力攻击任何随机的相邻单位。该生物将尽可能攻击敌方单位而非友方单位。如果被攻击的生物是（攻击者的）友方，则该攻击不会被反击。"
mName="癫狂诅咒"
mTooltip="使目标生物以 %buff1.buff.stat1 %buff1.buff.stat1.icon 攻击力攻击任何随机的相邻单位。如果被攻击的生物是（攻击者的）友方，则该攻击不会被反击。"

[Imprinted.A_Frenzy_Imprinted H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="癫狂诅咒"
mTooltip="使目标生物以 %buff1.buff.stat1 %buff1.buff.stat1.icon 攻击力攻击任何随机的相邻单位。如果被攻击的生物是（攻击者的）友方，则该攻击不会被反击。"

v1.31

[A_Nova H7HeroAbility]
mName="烈焰之墙"
mTooltip="对目标造成 %d %icon_fire 伤害，并在目标1x5区域创造一道火焰之墙，持续 %durini 战斗回合。在回合开始时，对所有区域内的生物造成 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 火系伤害。它还会阻止生物移动。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuild="对目标造成 %d %icon_fire 伤害，并在目标1x5区域创造一道火焰之墙，持续 %durini 战斗回合。在回合开始时，对所有区域内的生物造成 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 火系伤害。它还会阻止生物移动。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipUpgraded="对目标造成 %d %icon_fire 伤害，并在目标1x5区域创造一道火焰之墙，持续 %durini 战斗回合。在回合开始时，对所有区域内的生物造成 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 火系伤害。它还会阻止生物移动，并且它们会受到 %buff3.buff.d.min 到 %buff3.buff.d.max %ICON_FIRE 火系伤害，持续 %buff3.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d %icon_fire 和 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon"

v1.33

[Tourment.A_Nova H7HeroAbility]
mTooltipMagicGuild="对目标单位造成 %d.icon 火系伤害，目标生物的幸运在 %buff1.buff.durini 回合内降低至 %buff1.buff.stat1。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="对目标单位造成 %d.min 到 %d.max %d.icon 火系伤害，目标生物的幸运在 %buff2.buff.durini 回合内降低至 %buff2.buff.stat1。"
mName="折磨"
mTooltip="对目标单位造成 %d.min 到 %d.max %d.icon 火系伤害，并且目标生物的幸运在 %buff1.buff.durini 回合内降低至 %buff1.buff.stat1。"

v1.37

[A_Armageddon H7HeroAbility]
mTooltipMagicGuild="立即对所有单位造成 %d.icon 火系伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded=""
mName="末日审判"
mTooltip="立即对所有单位造成 %d.min 到 %d.max %d.icon 火系伤害。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[A_FireSentry H7HeroAbility]
mTooltipMagicGuild="在目标空地上召唤一个1x1的烈焰哨位。它持续到接下来2个战斗回合结束或被摧毁为止。烈焰哨位在每个战斗回合结束时和战斗回合中第一个进行远程攻击的敌方生物出现时，向两个最近的随机敌方生物喷射火焰。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%special.val1 生命值，射击造成 %special.val2 到 %special.val3 %icon_fire 火系伤害。"
mTooltipUpgraded=""
mName="烈焰哨位"
mTooltip="在目标空地上召唤一个1x1的烈焰哨位，拥有 %special.val1 点生命值。它持续到接下来2个战斗回合结束或被摧毁为止。烈焰哨位在每个战斗回合结束时和战斗回合中第一个进行远程攻击的敌方生物出现时，向两个最近的随机敌方生物射击。每次射击造成 %special.val2 到 %special.val3 %icon_fire 火系伤害。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

v1.37/2

[A_InnerFire_Buff H7BaseBuff]
mName="心灵之火"
mTooltip="%stat1 %stat1.icon 攻击\n%stat2 最大伤害\n持续 %durnow 回合。"

v1.38

[rework.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="提升目标单位的 %ICON_ATTACK 攻击和最大伤害，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat1 %buff1.buff.stat1.icon 攻击 和 %buff1.buff.stat2 最大伤害"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff1.buff.stat1 %buff1.buff.stat1.icon 攻击 和 %buff1.buff.stat2 %buff1.buff.stat2.icon 最大伤害，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="心灵之火"
mTooltip="提升目标的攻击 %buff1.buff.stat1 %buff1.buff.stat1.icon 和最大伤害 %buff1.buff.stat2，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"

[A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="提升目标友方生物的 %buff1.buff.stat.icon 士气，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat %buff1.buff.stat.icon 士气"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 士气，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="燃烧意志"
mTooltip="提升目标友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 士气，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"

v1.39

[A_Fireball H7HeroAbility]
mTooltipMagicGuild="立即对目标3x3区域内的所有单位造成 %buff.buff.d.icon 火系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="立即对目标3x3区域内的所有单位造成 %d.min 到 %d.max %d.icon 火系伤害，并在其接下来的 %buff1.buff.durini 个回合开始时，对其造成 %buff1.buff.d.max %buff1.buff.d.icon 火系伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mName="连珠火球"
mTooltip="立即对目标3x3区域内的所有单位造成 %d.min 到 %d.max %d.icon 火系伤害。\n（冷却时间：%buff9.buff.durini 回合）"

[Meteorite.A_Firebolt H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 火系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="立即对所有敌方单位造成 %d.min 到 %d.max %d.icon 火系伤害，然后使它们在 %buff1.buff.durini 回合内易受火焰伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mName="陨石雨"
mTooltip="立即对所有敌方单位造成 %d.min 到 %d.max %d.icon 火系伤害。\n（冷却时间：%buff9.buff.durini 回合）"